# 数据类型总结
# 1.数据类型分类：基本数据类型（单个数据）和复合数据结构（多个数据的集合）
# 1.1 基本数据类型
""""""
"""
整型（int）          可计算，无小数点
浮点型（float）      可计算，有小数点
布尔型（bool）       只有True和False两个值
复数型（complex）    虚部带j，教学场景用
字符串（str）        不可修改，支持索引/切片
空值（None）         表示没有数据，单独类型

"""

# 1.2 复合数据结构

"""
列表（list）        有序、可增删改、元素可重复
元组（tuple）       有序、不可修改、元素可重复
字典（dict）        有序、键唯一、可增删改
集合（set）         无序、元素唯一、支持集合运算
"""

# 2. 公共操作 & 公共方法
"""
in/not in           判断元素是否存在
len()               统计元素个数
del                 删除变量/元素
sum()               求和（只对数值有效）
max()               求最大值
min()               求最小值
"""

# 3. 类型转换
"""
int()               转化为整数
float()             转换为浮点数
bool()              转换为布尔值
str()               转化为字符串
eval()              执行字符串表达式，并返回表达式的值
list()              转化为列表
tuple()             转化为元组
dict()              转化为字典
set()               转化为集合
"""